app/Controllers/Admin.php

INSERT INTO `traffic` (`traffic_hal`) VALUES (22)
---
    public function __construct()
    {
        $trafficModel = new TrafficModel();
        $trafficModel->insert([
            'traffic_hal' => 22
        ]);