app/Controllers/Auth.php

INSERT INTO `traffic` (`traffic_hal`) VALUES (12)
---
    public function admin_signin(): ResponseInterface
    {
        $session = session();
        if ($session->get('status') == 'login-admin') {
            return redirect()->to('dashboard');
        }

        $trafficModel = new TrafficModel();
        $trafficModel->insert([
            'traffic_hal' => 12
        ]);