app/Controllers/Berita.php

SELECT *
FROM `berita`
---
    public function lihat($berita_id): string
    {
        $status = [
            'page' => 'berita',
            'judul' => 'Lihat Detail Berita'
        ];

        $beritaModel = new BeritaModel();
        $beritaModel->find();

SELECT *
FROM `berita`
WHERE `berita_slug` = 'berita-pertama'
 LIMIT 1
---
        $slug = url_title($judul, '-', true);
        $slugAsli = $slug;
        $i = 1;
        while ($beritaModel->where('berita_slug', $slug)->first()) {

INSERT INTO `berita` (`berita_judul`, `berita_gambar`, `berita_isi`, `berita_slug`, `admin_username`, `created_at`, `updated_at`) VALUES ('berita pertama', NULL, '<p>vhdfjhdcmds</p>\r\n', 'berita-pertama', 'root', '2025-02-12 21:01:07', '2025-02-12 21:01:07')
---
            'admin_username' => $admin_username
        ];

        $beritaModel->insert($save);