app/Controllers/Berita.php

    public function __construct()
    {
        $trafficModel = new TrafficModel();
        $trafficModel->insert([
            'traffic_hal' => 1
        ]);
---
INSERT INTO `traffic` (`traffic_hal`) VALUES (1)

    public function index(): string
    {
        $status = [
            'page' => 'berita',
            'judul' => 'Atur Berita'
        ];

        $beritaModel = new BeritaModel();
        $berita = $beritaModel->findAll();
---
SELECT *
FROM `berita`
ORDER BY `created_at` DESC

        ];

        $beritaModel = new BeritaModel();
        $beritaModel->insert($save);
---
INSERT INTO `berita` (`berita_judul`, `berita_gambar`, `berita_isi`, `created_at`, `updated_at`) VALUES ('iwenkwrlbwl', NULL, '<p>nnkcevnfvn</p>\r\n', '2025-02-12 20:34:40', '2025-02-12 20:34:40')