app/Controllers/Home.php

INSERT INTO `traffic` (`traffic_hal`) VALUES (1)
---
    public function __construct()
    {
        $trafficModel = new TrafficModel();
        $trafficModel->insert([
            'traffic_hal' => 1
        ]);

SELECT *
FROM `hero`
WHERE `hero`.`hero_id` = 1
SELECT *
FROM `berita`
ORDER BY `created_at` DESC
 LIMIT 2
---
    public function index(): string
    {
        $status = [
            'page' => 'home',
            'judul' => 'Home'
        ];

        $reward = new RewardGolonganModel();
        $rewardall = $reward->getAllReward();
        $groupedRewards = [];
        foreach ($rewardall as $reward) {
            $groupedRewards[$reward['reward_golongan_id']][$reward['reward_golongan_berat']][] = $reward;
        }

        $heroModel = new HeroModel();
        $aboutusData = $heroModel->find(1)['hero_isi'];
        preg_match('/<p>(.*?)<\/p>/', $aboutusData, $matches);
        $aboutus = isset($matches[0]) ? $matches[0] : '';

        $beritaModel = new BeritaModel();
        $beritaData = $beritaModel->orderBy('created_at', 'DESC')->findAll(2);

SELECT SUM(`setoran_jumlah`) AS `setoran_jumlah`
FROM `setoran`
 LIMIT 1
---
        }

        $setoranModel = new SetoranModel();
        $setoranJumlahData = $setoranModel->selectSum('setoran_jumlah')->first();