app/Controllers/Root.php

INSERT INTO `traffic` (`traffic_hal`) VALUES (23)
---
    public function __construct()
    {
        $trafficModel = new TrafficModel();
        $trafficModel->insert([
            'traffic_hal' => 23
        ]);

SELECT *
FROM `hero`
WHERE `hero`.`hero_id` = 1
---
    public function edit_aboutus(): mixed
    {
        $session = session();
        if ($session->get('admin_username') !== 'root') {
            return redirect()->to('dashboard');
        }

        $status = [
            'page' => 'konten',
            'judul' => 'Edit About Us'
        ];

        $heroModel = new HeroModel();
        $hero = $heroModel->find(1);