app/Models/RewardGolonganModel.php

SELECT `reward_golongan`.*, `reward_barang`.`reward_barang_id`, `reward_barang`.`reward_barang_barang`, `reward_barang`.`created_at` AS `barang_created_at`
FROM `reward_golongan`
LEFT JOIN `reward_barang` ON `reward_barang`.`reward_golongan_id` = `reward_golongan`.`reward_golongan_id`
ORDER BY `reward_golongan`.`reward_golongan_berat` ASC
---
    public function getAllReward()
    {
        return $this->select('reward_golongan.*, reward_barang.reward_barang_id, reward_barang.reward_barang_barang, reward_barang.created_at AS barang_created_at')
                    ->join('reward_barang', 'reward_barang.reward_golongan_id = reward_golongan.reward_golongan_id', 'left')
                    ->orderBy('reward_golongan.reward_golongan_berat', 'ASC')
                    ->findAll();