app/Models/SetoranModel.php

SELECT SUM(`setoran_jumlah`) AS `setoran_jumlah`
FROM `setoran`
WHERE DATE(created_at) = '2025-01-20'
 LIMIT 1
---
    public function dashboard_sampahterkumpul()
    {
        $today = date('Y-m-d');

        return $this->selectSum('setoran_jumlah')
                    ->where('DATE(created_at)', $today)
                    ->first();

SELECT COUNT(*) AS `numrows`
FROM `setoran`
WHERE DATE(created_at) = '2025-01-20'
---
    public function dashboard_stempelterbagi()
    {
        $today = date('Y-m-d');

        return $this->where('DATE(created_at)', $today)
                    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `peserta_id`
FROM `setoran`
WHERE DATE(created_at) = '2025-01-20'
) CI_count_all_results
---
    public function dashboard_pesertaaktif()
    {
        $today = date('Y-m-d');

        return $this->select('peserta_id')
                    ->where('DATE(created_at)', $today)
                    ->distinct()
                    ->countAllResults();

SELECT DATE(created_at) as tanggal, SUM(setoran_jumlah) as total_setoran
FROM `setoran`
GROUP BY DATE(created_at)
ORDER BY `tanggal` ASC
---
    public function analitik_setoranall()
    {
        return $this->select('DATE(created_at) as tanggal, SUM(setoran_jumlah) as total_setoran')
                    ->groupBy('DATE(created_at)')
                    ->orderBy('tanggal', 'ASC')
                    ->findAll();